var express = require('express');
var router = express.Router();

/* GET home page. */
router.get('/', function(req, res, next) {
  res.render('index', { title: 'Express' });
});

var mock = require('mockjs');

mock.Random.extend({
	foreName:function(data){
  	var foreNames = [
    	'电器','手机','数码','通信','电脑','办公','家居','家具','家装','厨具','男装','内衣','女装',
      '童装','化妆','清洁用品','宠物','鞋靴','箱包','珠宝','奢侈品','运动','户外','钟表','汽车',
      '汽车用品','母婴','玩具','乐器','食品','酒类','生鲜','特产','医用','保健','图书','音像','电子书',
      '彩票','旅行','充值','票务','理财','众筹','白条','保险'
		];
    return this.pick(foreNames);
  },
  dropName:function(data){
  	var dropNames = [
    	'大家电','厨卫大电','厨房小电','生活电器','个护健康','五金家装','电子书刊','音像','文艺','少儿','人文','社科',
      '经管励志','生活','科技','教育','其他','奶粉','营养辅食','尿裤湿巾','喂养用品','洗护用品','童车童床','童装童鞋','安全座椅','妈妈转区',
      '手机通讯','运营商','手机配件','潮流女包','精品男包','功能箱包','礼品','奢侈品','婚庆','进口食品','地方特产','休闲食品',
      '粮油调味','饮料冲调','食品礼券','茗茶','摄影摄像','数码配件','智能设备','影音娱乐','电子教育','虚拟商品','时尚饰品','黄金',
      'K金饰品','金银投资','钻石','银饰','水晶玛瑙','翡翠玉石','铂金','彩宝','珍珠','家纺','灯具','生活日用','电脑整机','电脑配件','外设',
      '游戏设备','网络产品','办公设备','文具耗材','服务产品','维修保养','车载电器','美容清洗','汽车装饰','安全自驾','汽车服务','赛事改装',
      '烹饪锅具','刀剑菜板','厨房配件','水具茶具','餐具','酒店用品','咖啡具','运动鞋包','运动服饰','骑行运动','垂钓用品','游泳用品','户外鞋服',
      '户外装备','健身训练','体育用品','清洁用品','清洁用品','面部护理','身体护理','口腔护理','女性护理','洗头护发','香水彩妆','遥控电动',
      '模型玩具','动漫玩具','益智玩具','DIY玩具','创意减压','乐器','女装','男装','内衣','服饰配件','彩票','机票','酒店','旅行','充值','票务',
  		'产地直供','猪牛羊肉','海鲜水产','禽肉蛋品','冷冻食品','熟食腊味','饮品甜品','蔬菜','流行男鞋','时尚女鞋','全新整车','二手车'
    ];
    return this.pick(dropNames);
  },
  subName:function(data){
  	var subNames = [
    	'电子书','音乐','影视','小说','文字','传记','历史','哲学','国学','人文社科','心理学','文化','社会科学','经济','金融与投资','管理','孕妈奶粉',
      '生活','健身与保健','烹饪美食','旅游','家庭育儿','工业科技','科普读物','建筑','医学','科学与自然','计算机与互联网','电子通信','婴幼奶粉',
      '果泥果汁','益生菌初乳','面条粥','DHA','钙铁锌维生素','清火开胃','婴儿尿裤','拉拉裤','婴儿湿巾','成人尿裤','吸奶器','奶瓶奶嘴','辅食料理机',
      '食物储存','水壶水杯','儿童餐具','暖奶消毒','婴儿推车','婴儿床','扭扭车','滑板车','婴儿内衣','安全防护','爬行垫','婴儿礼盒','婴儿外出服',
      '妈咪包','产后塑身','孕妇文胸内裤','月子装','安全座椅','增高垫','提篮式','手机','对讲机','合约机','移动电源','电池','蓝牙耳机','充电器',
      '数据线','苹果周边','手机耳机','手机贴膜','手机储存卡','手机保护套','车载配件','苹果配件','创意配件','无线音箱','手机饰品','拍照配件',
      '手机支架','钱包','单肩包','手拿包','双肩包','斜挎包','钥匙包','卡包','零钱包','名片夹','商务包','电脑包','拉杆箱','旅行包','运动包',
      '登山包','书包','相机包','腰包','书包','火机烟具','军刀军具','工艺礼品','创意礼品','鲜花绿植','古董文化','礼品定制','礼盒礼券','婚庆节庆',
      '高档化妆品','饰品','名品腕表','婚嫁首饰','婚纱摄影','婚纱礼服','婚庆服务','婚庆用品','婚宴用品','平板电视','空调','冰箱','洗衣机','家庭影院',
      '电视盒子','冷柜','冰吧','家电配件','功放','回音壁','Hi-Fi转区','酒柜','燃气灶','抽烟机','热水器','消毒柜','洗碗机','料理机','榨汁机','电饭煲',
      '电压力煲','电磁炉','电烤箱','酸奶机','热水壶','取暖电器','加湿器','插座','清洁机','电风扇','扫地机器人','干衣机','除湿机','剃须刀','电吹风',
      '按摩椅','按摩器','体温计','电动工具','插座','浴霸','排气扇','LED灯','淋浴花洒','龙头','饼干蛋糕','糖果','巧克力','休闲零食','粮油调味','牛奶',
      '坚果炒货','肉干肉脯','无糖食品','南北干货','方便食品','有机食品','米面杂粮','饮用水','饮料','乳品','咖啡奶茶','冲饮谷物','蜂蜜','成人奶粉',
      '大闸蟹','粽子','铁观音','普洱','龙井','绿茶','红茶','乌龙茶','花草茶','花果茶','养生茶','黑茶','白茶','其他茶','数码相机','微单相机','单方',
      '镜头','户外器材','数码相框','读卡器','闪光灯','三脚架','数码支架','机身附体','镜头附体','相机清洗','智能手环','智能手表','智能眼镜','智能配饰',
      '体感车','无人机','其他配件','MP3/MP4','耳机/耳麦','高清播放器','收音机','麦克风','专业音频','苹果配件','录音笔','积分商品','项链','手链',
      '脚链','戒指','胸针','饰品配件','婚庆饰品','耳饰','K金吊坠','K金项链','K金手镯','银戒指','银耳饰','裸钻','钻戒','钻石吊坠','钻石耳饰','挂件',
      '摆件','玉石孤品','琥珀蜜蜡','碧玺','红宝石','蓝宝石','珊瑚','祖母绿','葡萄石','铂金项链','铂金吊坠','铂金戒指','铂金手链','沉香木','金丝楠',
      '黄花梨','酸枝木','菩提','檀香','笔记本','超级本','游戏本','平板电脑','台式机','CPU','主板','内存','显卡','硬盘','SSD固态硬盘','机箱','电源',
      '显示器','T恤','衬衫','卫衣','马甲','雪纺衫','连身裙','半身裙','打底裤','休闲裤','短裤','羊绒衫','西服','夹克','风衣','中山装','文胸','内裤',
      '睡衣','泳衣','吊带背心','抹胸','丝袜','袜子','情趣内衣','太阳镜','围巾','手套','帽子','领带','腰带','披肩','游戏点卡','手机充值','男表','女表',
      '日本表','欧美表','德表','闹钟','座钟挂钟','中型车','中大型车','SUV','跑车','正装鞋','休闲鞋','凉鞋','男鞋','女鞋','拖鞋','帆布鞋','定制鞋',
      '高跟鞋','马丁鞋','松糕鞋','鱼嘴鞋','果汁','冰激凌','叶菜类','瓜果类','鲜菇类','熟食','腊肠','火腿','糕点','水饺馄饨','汤圆','奶酪黄油',
      '鸡肉','鸭肉','蛋类','其他禽类','鱼虾蟹','贝类','海参','海产干货','其他水产','牛肉','羊肉','猪肉','内脏类','苹果','车厘子','芒果','蓝莓',
      '菠萝','香蕉','草莓','火龙果','二胡','小提琴','钢琴','吉他','口琴','电影周边','游戏周边','泳镜','泳帽','比基尼','牙膏','羽毛球','篮球','足球',
      '网球','排球','高尔夫','台球','棋牌麻将','滑板','跑步机','滑雪装备','野餐烧烤','睡袋','吊床','香水','眼影','唇部','美甲','眼线','眉笔','雨伞',
      '沐浴','润肤','精油','肥皂','浴盐','磨砂膏','护发','洗发','香薰','卫生巾','路由器','网卡','移动硬盘','U盘','鼠标','键盘','散热器','服务器',
      '游戏机','游戏耳机','手柄','方向盘','交换机','一体机','装饰灯'
    ];
    return this.pick(subNames);
  }
});

var template = {
    'categorys|15':[{
    	'foreName|4':'@foreName',
      'foreId|+1':1,
      'foreUrl':'@url',
      'dropItem|5-10':[{
				'dropName|1':'@dropName',
        'dropId|+1':100,
        'dropUrl':'@url',
        'subItem|1-30':[{
        	'subName|1':'@subName',
          'subId|+1':1000,
          'subUrl':'@url',
          
        }]
      }],
      'foreBrands|10':[{
      	'images':'@image("168x134","#c91623","#fff","jpg","banner")'
      }]
    }]
}


var data = mock.mock(template);
router.get('/mockjs', function(req, res, next) {
	var callback = req.query.callback;
	var ret = JSON.stringify(data,null,4);
	var ret = callback + '(' + ret + ')';
	res.send(ret);
});

module.exports = router;
console.log();